app/views/songs/edit.html.erb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT 1  [["id", 7]]
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = $1 LIMIT 1  [["id", 7]]
---
    <% #INCLUDE BECAUSE THE FORM FOR REQUIRES THESE VARIABLES IN CASE OF RE-RENDER %>
    <%  @artist = Artist.find(params["artist_id"]) %>
    <%  @genre = Genre.find(params["genre_id"]) %>