app/controllers/artists_controller.rb

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = $1 LIMIT 1  [["id", 7]]
---
  def new
    @artist = Artist.new
    @genre = Genre.find(params["genre_id"])

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = $1 LIMIT 1  [["id", 15]]
INSERT INTO "artists" ("artist_name", "artist_bio", "img_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @artist = Artist.new(artist_params)
    genre_id = Genre.find(params["genre_id"])
    @artist.genres.push(genre_id)

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT 1  [["id", 6]]
SELECT  "artists".* FROM "artists"  ORDER BY "artists"."id" DESC LIMIT 1
SELECT  1 AS one FROM "songs" WHERE "songs"."id" = $1 LIMIT 1  [["id", 7]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = $1  [["artist_id", 6]]
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = $1 LIMIT 1  [["id", 15]]
SELECT "genres".* FROM "genres" INNER JOIN "artists_genres" ON "genres"."id" = "artists_genres"."genre_id" WHERE "artists_genres"."artist_id" = $1  [["artist_id", 7]]
---
  def show
    @artist = Artist.find(params["id"])

    if @artist.songs.nil? || !Song.exists?(params["genre_id"])
      @genre = Genre.find(params["genre_id"])
    else
      binding.pry
      current_song = Song.find(params["genre_id"]) #<-- this is a bug.
      genre_id = current_song.genre.id