app/controllers/genres_controller.rb

INSERT INTO "genres" ("genre_name", "genre_description", "img_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @genre = Genre.new(genre_params)
    @genre.user_id = current_user.id
    if @genre.save

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = $1 LIMIT 1  [["id", 6]]
SELECT  "artists".* FROM "artists"  ORDER BY "artists"."id" ASC LIMIT 1
SELECT "genres".* FROM "genres" INNER JOIN "artists_genres" ON "genres"."id" = "artists_genres"."genre_id" WHERE "artists_genres"."artist_id" = $1  [["artist_id", 4]]
---
  def show
    @genre = Genre.find(params[:id])
    all_artists = Artist.all
    @artists = []
    all_artists.each do |artist|
      if artist.genres.any? {|genre| genre.id == @genre.id }