app/controllers/songs_controller.rb

INSERT INTO "songs" ("song_name", "song_comment", "scloud_embed") VALUES ($1, $2, $3) RETURNING "id"  [["song_name", "kakos rock"], ["song_comment", "no comment"], ["scloud_embed", "kakos"]]
---
  def create
    @song = Song.new(song_params)
    @song.artist_id = params["artist_id"]
    @song.genre_id = params["genre_id"]
    @song.user_id = current_user.id
    if @song.save

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT 1  [["id", 20]]
---
  def edit
    @song = Song.find(params["id"])

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT 1  [["id", 20]]
UPDATE "songs" SET "song_comment" = $1 WHERE "songs"."id" = $2  [["song_comment", "MAZING"], ["id", 20]]
---
  def update
    @song = Song.find(params["id"])
    if @song.update(song_params)

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT 1  [["id", 19]]
DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 19]]
---
  def destroy
    song = Song.find(params["id"])
    song.destroy