app/controllers/songs_controller.rb

  def new
    @song = Song.new
    @artist = Artist.find(params["artist_id"])
    @genre = Genre.find(params["genre_id"])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT 1  [["id", nil]]
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = $1 LIMIT 1  [["id", 15]]